Autodesk.Revit.DB.BaseExportOptions.SetExportFontTable(Autodesk.Revit.DB.ExportFontTable)
Sets font table to option.
fontTable:
The font table to be set.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2013

Autodesk.Revit.DB.BaseExportOptions.SetExportPatternTable(Autodesk.Revit.DB.ExportPatternTable)
Sets the pattern table to use during export.
patternTable:
The pattern table to be set.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2014

Autodesk.Revit.DB.BaseExportOptions.SetExportLinetypeTable(Autodesk.Revit.DB.ExportLinetypeTable)
Sets the line type table to use during export.
linetypeTable:
The line type table to be set.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2014

Autodesk.Revit.DB.BaseExportOptions.SetExportLayerTable(Autodesk.Revit.DB.ExportLayerTable)
Sets layer table back to option
layerTable:
The layer table to be set
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2014

Autodesk.Revit.DB.BaseExportOptions.GetPredefinedSetupNames(Autodesk.Revit.DB.Document)
Returns a list of names of predefined setups of export options.
Remarks:
The predefined setups may be used for export to both DWG and DXF formats.
To get predefined options in the desired format use the static method
getPredefinedOptions defined in DWGExportOptions or DXFExportOptions respectively.
document:
A Revit document to retrieve names from.
Returns:
An array of strings representing names of predefined setups.
Throws Autodesk.Revit.Exceptions.ArgumentException:
document is not a project document.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2013

Autodesk.Revit.DB.BaseExportOptions.HatchPatternsFileName
Custom hatch patterns (pat) file name.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2013

Autodesk.Revit.DB.BaseExportOptions.LayerMapping
Name of a layer settings standard or filename (with custom layer settings).
Valid standards are: DGNV7 (only for DGN), AIA, CP83, BS1192, and ISO13567.
default value is "" (empty) which means if no value is set,
if no value is set, Revit will use a default value according to the localization.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2013